      ******************************************************************
      *  Author:        Jake Elliott
      *  Student ID:    040732505
      *  Course:        CST8283 Section 302
      *  Date:          7/10/2025
      *  Purpose:       CREATES STOCK REPORT
      *  Tectonics:     cobc
      ******************************************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. CREATE-STOCK-REPORT.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PORTFOLIO-FILE
               ASSIGN TO "../PORTFOLIO.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT STOCK-FILE
               ASSIGN TO "../STOCKS.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT REPORT-FILE
               ASSIGN TO "../REPORT.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  STOCK-FILE.
       01  STOCK-RECORD.
           05  STOCK-SYMBOL PIC X(7).
           05  STOCK-NAME PIC X(25).
           05  STOCK-CLOSING-PRICE PIC 9(4)V99.

       FD  PORTFOLIO-FILE.
       01  PORTFOLIO-RECORD.
           05  PTFL-SYMBOL PIC X(7).
           05  PTFL-NUM-SHARES PIC 9(5).
           05  PTFL-AVG-COST PIC 9(4)V99.

       FD  REPORT-FILE.
       01  REPORT-RECORD PIC X(120).

       WORKING-STORAGE SECTION.
       01  CONTROL-FIELDS.
           05  EOF-FLAG PIC A.
           05  FOUND-FLAG PIC A.
           05  SUB PIC 9(2).

       01  CALCULATED-FIELDS.
           05  AT-CLOSING-CALC PIC 9(4)V99.
           05  COST-BASE-CALC PIC S9(5)V99.
           05  MARKET-VALUE-CALC PIC S9(5)V99.
           05  GAIN-LOSS-CALC PIC S9(5)V99.

       01  TABLES.
           05  STOCKS-TABLE OCCURS 20 TIMES INDEXED BY IDX.
               10  STOCK-SYMBOL-TBL PIC X(7).
               10  STOCK-NAME-TBL PIC X(25).
               10  STOCK-CLOSING-PRICE-TBL PIC 9(4)V99.

       01  REPORT-DATA.
           05  DASH-LINE PIC X(120) VALUE ALL "=".
           05  HEADER-LINE.
             10  FILLER PIC X(27) VALUE "STOCK NAME                ".
             10  FILLER PIC X(10) VALUE "#SHARES   ".
             10  FILLER PIC X(11) VALUE "UNIT COST  ".
             10  FILLER PIC X(13) VALUE "AT CLOSING   ".
             10  FILLER PIC X(11) VALUE "COST BASE  ".
             10  FILLER PIC X(15) VALUE "MARKET VALUE   ".
             10  FILLER PIC X(10) VALUE "GAIN/LOSS".
           05  DETAILS-LINE.
             10  STOCK-NAME-OUT PIC X(25).
             10  FILLER                   PIC X(2)  VALUE SPACES.
             10  NUM-SHARES-OUT PIC ZZZZZ9.
             10  FILLER PIC X(5)  VALUE SPACES.
             10  UNIT-COST-OUT PIC $$$,$$9.99.
             10  FILLER PIC X(2)  VALUE SPACES.
             10  AT-CLOSING-OUT PIC $$$,$$9.99.
             10  FILLER PIC X(4)  VALUE SPACES.
             10  COST-BASE-OUT PIC $$$,$$9.99.
             10  FILLER PIC X(2)  VALUE SPACES.
             10  MARKET-VAL-OUT PIC $$$,$$9.99.
             10  FILLER PIC X(6)  VALUE SPACES.
             10  GAIN-LOSS-OUT PIC $$$,$$9.99-.
           05  AUDIT-LINE.
             10  FILLER PIC X(14) VALUE "RECORDS READ: ".
             10  READ-CTR PIC 9(2).
             10  FILLER PIC X(18) VALUE " RECORDS WRITTEN: ".
             10  WRITE-CTR PIC 9(2).

       PROCEDURE DIVISION.
       100-CREATE-STOCK-REPORT.
           PERFORM 201-INITIALIZE-PROGRAM
           PERFORM 202-CREATE-ONE-RECORD-REPORT UNTIL EOF-FLAG = "Y"
           PERFORM 203-END-PROGRAM
           STOP RUN.

       201-INITIALIZE-PROGRAM.
           PERFORM 301-OPEN-STOCK-FILES
           PERFORM 302-LOAD-STOCK-TABLES VARYING SUB FROM 1 BY 1
           UNTIL SUB > 20 OR EOF-FLAG = "Y"
           MOVE "N" TO EOF-FLAG
           PERFORM 303-READ-STOCK-PORTFOLIO
           PERFORM 304-WRITE-HEADER-REPORT.

       301-OPEN-STOCK-FILES.
           OPEN INPUT  PORTFOLIO-FILE STOCK-FILE
           OPEN OUTPUT REPORT-FILE.

       302-LOAD-STOCK-TABLES.
           READ STOCK-FILE AT END MOVE "Y" TO EOF-FLAG
           NOT AT END
           MOVE STOCK-RECORD TO STOCKS-TABLE(SUB)
           END-READ.

       303-READ-STOCK-PORTFOLIO.
           READ PORTFOLIO-FILE AT END MOVE "Y" TO EOF-FLAG
           NOT AT END
           MOVE PTFL-NUM-SHARES TO NUM-SHARES-OUT
           MOVE PTFL-AVG-COST TO UNIT-COST-OUT
           ADD 1 TO READ-CTR
           END-READ.

       304-WRITE-HEADER-REPORT.
           WRITE REPORT-RECORD FROM DASH-LINE
           WRITE REPORT-RECORD FROM HEADER-LINE
           WRITE REPORT-RECORD FROM DASH-LINE.

       202-CREATE-ONE-RECORD-REPORT.
           MOVE "N" TO FOUND-FLAG
           PERFORM 305-SEARCH-STOCK-TABLE VARYING SUB FROM 1 BY 1
           UNTIL SUB > 20 OR FOUND-FLAG = "Y"
           PERFORM 306-CALCULATE-PORTFOLIO-VALUE
           PERFORM 307-WRITE-REPORT-RECORD
           PERFORM 303-READ-STOCK-PORTFOLIO.

       305-SEARCH-STOCK-TABLE.
           IF PTFL-SYMBOL = STOCK-SYMBOL-TBL(SUB)
             MOVE "Y" TO FOUND-FLAG
             MOVE STOCK-NAME-TBL(SUB) TO STOCK-NAME-OUT
             MOVE STOCK-CLOSING-PRICE-TBL(SUB) TO AT-CLOSING-CALC
             MOVE STOCK-CLOSING-PRICE-TBL(SUB) TO AT-CLOSING-OUT
           END-IF.

       306-CALCULATE-PORTFOLIO-VALUE.
           COMPUTE COST-BASE-CALC = PTFL-NUM-SHARES * PTFL-AVG-COST
           MOVE COST-BASE-CALC TO COST-BASE-OUT
           COMPUTE MARKET-VALUE-CALC = PTFL-NUM-SHARES * AT-CLOSING-CALC
           MOVE MARKET-VALUE-CALC TO MARKET-VAL-OUT
           COMPUTE GAIN-LOSS-CALC = MARKET-VALUE-CALC - COST-BASE-CALC
           MOVE GAIN-LOSS-CALC TO GAIN-LOSS-OUT.

       307-WRITE-REPORT-RECORD.
           WRITE REPORT-RECORD FROM DETAILS-LINE
           ADD 1 TO WRITE-CTR.

       203-END-PROGRAM.
           PERFORM 308-WRITE-STOCK-FOOTER-REPORT
           PERFORM 309-CLOSE-FILES
           PERFORM 310-DISPLAY-STOCK-COUNTER.

       308-WRITE-STOCK-FOOTER-REPORT.
           WRITE REPORT-RECORD FROM DASH-LINE
           WRITE REPORT-RECORD FROM AUDIT-LINE AFTER ADVANCING 1 LINE.

       309-CLOSE-FILES.
           CLOSE PORTFOLIO-FILE STOCK-FILE REPORT-FILE.

       310-DISPLAY-STOCK-COUNTER.
           DISPLAY "INVESTMENT REPORT CREATED (REPORT.TXT)"
           DISPLAY AUDIT-LINE.

       END PROGRAM CREATE-STOCK-REPORT.
